namespace ITFCode.Domain.Entities.Lexicon.Enums
{
    public enum PartsOfSpeech
    {
        Noun = 10,  // Существительное (Noun) - это имя предмета, места, человека или идеи, например: dog (собака), city (город), person (человек), love (любовь).
        Adjective = 20, // Прилагательное (Adjective) - это слово, которое описывает или дополняет существительное, например: beautiful (красивый), happy (счастливый), blue (синий).
        Verb = 30, // Глагол (Verb) - это слово, которое выражает действие, состояние или процесс, например: run (бежать), eat (есть), think (думать).
        Adverb = 40, // Наречие (Adverb) - это слово, которое описывает глагол, прилагательное или другое наречие, например: quickly (быстро), happily (счастливо), very (очень).
        Pronoun = 50, //Местоимение (Pronoun) - это слово, которое заменяет существительное, например: he (он), she (она), it (оно), they (они).
        Preposition = 60, //Предлог (Preposition) - это слово, которое используется для связи слов в предложении, например: in (в), on (на), at (в).
        Conjunction = 70 , // Союз (Conjunction) - это слово, которое используется для соединения слов или предложений, например: and (и), but (но), or (или).
        Interjection = 80 //Междометие (Interjection) - это слово или выражение, которое используется для выражения эмоций или чувств, например: oh (о), wow (вау), ouch (ай).
    }
}